src/cf/InformationRegisters/НастройкиПользователейТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователейТелефонии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийИдентификаторВАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПользователейТелефонии/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) И Параметры.Свойство("Пользователь") Тогда
		МенеджерЗаписи = РегистрыСведений.НастройкиПользователейТелефонии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Параметры.Пользователь;
		МенеджерЗаписи.Прочитать();
		ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийЭлемент") Тогда
		Элемент = Элементы.Найти(Параметры.ТекущийЭлемент);
		Если Элемент <> Неопределено Тогда
			ТекущийЭлемент = Элемент;
		КонецЕсли;
	КонецЕсли;
	
	НастройкиФормы = ТелефонияПереопределяемый.НастройкиФормыПользователей();
	Элементы.ИсходящийНомер.Видимость = НастройкиФормы.ПоказыватьИсходящийНомер;
	
КонецПроцедуры

#КонецОбласти
